DataProcessors/ирРедакторПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ирРедакторПользователей</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АутентификацияОС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АутентификацияСтандартная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантИнтерфейсаКлиентскогоПриложения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантМасштабаФормКлиентскогоПриложения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойИнтерфейс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойИнтерфейсПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборПоРолям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьПанелиНавигацииИДействий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображатьПанельРазделов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольУстановлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказыватьВСпискеВыбора</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПользовательОС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимЗапуска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимОткрытияФормПриложения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РолиИмена</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РолиПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкоростьКлиентскогоСоединения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УникальныйИдентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Язык</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯзыкПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиПользователя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Включена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ирРедакторПользователей/Forms/УстановкаНастроекПриложения/Ext/Form/Module.bsl
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Результат = Новый Структура;
	Если ВариантИнтерфейсаКлиентскогоПриложенияУстановить Тогда
		Результат.Вставить("ВариантИнтерфейсаКлиентскогоПриложения", Вычислить("ВариантИнтерфейсаКлиентскогоПриложения." + ВариантИнтерфейсаКлиентскогоПриложенияЗначение));
	КонецЕсли;
	Если ВариантМасштабаФормКлиентскогоПриложенияУстановить Тогда
		Результат.Вставить("ВариантМасштабаФормКлиентскогоПриложения", Вычислить("ВариантМасштабаФормКлиентскогоПриложения." + ВариантМасштабаФормКлиентскогоПриложенияЗначение));
	КонецЕсли;
	Если РежимОткрытияФормПриложенияУстановить Тогда
		Результат.Вставить("РежимОткрытияФормПриложения", Вычислить("РежимОткрытияФормПриложения." + РежимОткрытияФормПриложенияЗначение));
	КонецЕсли; 
	Если ОтображатьПанелиНавигацииИДействийУстановить Тогда
		Результат.Вставить("ОтображатьПанелиНавигацииИДействий", ОтображатьПанелиНавигацииИДействийЗначение);
	КонецЕсли; 
	Если ОтображатьПанельРазделовУстановить Тогда
		Результат.Вставить("ОтображатьПанельРазделов", ОтображатьПанельРазделовЗначение);
	КонецЕсли; 
	Закрыть(Результат);
	
КонецПроцедуры

Процедура ОбновитьДоступность()
	
	ЭлементыФормы.ВариантИнтерфейсаКлиентскогоПриложенияТакси.Доступность = ВариантИнтерфейсаКлиентскогоПриложенияУстановить;
	ЭлементыФормы.ВариантИнтерфейсаКлиентскогоПриложенияВерсия8_2.Доступность = ВариантИнтерфейсаКлиентскогоПриложенияУстановить;
	ЭлементыФормы.ВариантМасштабаФормКлиентскогоПриложенияАвто.Доступность = ВариантМасштабаФормКлиентскогоПриложенияУстановить;
	ЭлементыФормы.ВариантМасштабаФормКлиентскогоПриложенияКомпактный.Доступность = ВариантМасштабаФормКлиентскогоПриложенияУстановить;
	ЭлементыФормы.ВариантМасштабаФормКлиентскогоПриложенияОбычный.Доступность = ВариантМасштабаФормКлиентскогоПриложенияУстановить;
	ЭлементыФормы.РежимОткрытияФормПриложенияОтдельныеОкна.Доступность = РежимОткрытияФормПриложенияУстановить;
	ЭлементыФормы.РежимОткрытияФормПриложенияЗакладки.Доступность = РежимОткрытияФормПриложенияУстановить;
	ЭлементыФормы.ОтображатьПанелиНавигацииИДействийЗначение.Доступность = ОтображатьПанелиНавигацииИДействийУстановить;
	ЭлементыФормы.ОтображатьПанельРазделовЗначение.Доступность = ОтображатьПанельРазделовУстановить;
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ОбновитьДоступность();
	
КонецПроцедуры

Процедура ПриИзмененииФлажка(Элемент)
	ОбновитьДоступность();
КонецПроцедуры

ЭтаФорма.ВариантИнтерфейсаКлиентскогоПриложенияЗначение = "Такси";
ЭтаФорма.ВариантМасштабаФормКлиентскогоПриложенияЗначение = "Авто";
ЭтаФорма.РежимОткрытияФормПриложенияЗначение = "ОтдельныеОкна";
ЭтаФорма.ОтображатьПанелиНавигацииИДействийЗначение = Истина;
ЭтаФорма.ОтображатьПанельРазделовЗначение = Истина;
